##  사이킷런으로 수행하는 타이타닉 생존자 예측

Data - > www.kaggle.com/c/titanic/data 에 접속해 데이터를 train.csv라는 이름으로 저장하면됨

passengerid : 탑승자 데이터 일련번호

survived : 생존 여부, 0 = 사망, 1 = 생존

pclass : 티켓의 선실 등급, 1 = 일등석, 2 = 이등석, 3 = 삼등석

sex : 탑승자 성별

age : 탑승자 나이

sibsp : 같이 탑승한 형제자매 또는 배우자 인원수

parch : 같이 탑승한 부모님 또는 어린이 인원수 

ticket : 티켓 번호

fare : 요금

cabin : 선실 번호

embarked : 중간 정착 항수 C = Cherbourg, Q = Queenstown, S = Southampton

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

titanic_df = pd.read_csv('./titanic_train.csv')
titanic_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [2]:
print('\n ### 학습 데이터 정보 ### \n')
print(titanic_df.info())

 ### 학습 데이터 정보 ###

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.6+ KB
None

사이킷런 머신러닝 알고리즘은 Null 값을 허용하지 않으므로 Null 값을 어떻게 처리할지 결정해야함.

여기서 DataFrame의 fillna() 함수를 사용해 간단하게 Null 값을 평균 또는 고정 값으로 변경하겠음.

Age의 경우는 평균 나이, 나머지 칼럼은 'N'값으로 변경.
그다음, 모든 칼럼의 Null 값이 없는지 다시 확인

In [4]:
titanic_df['Age'].fillna(titanic_df['Age'].mean(), inplace=True)
titanic_df['Cabin'].fillna('N',inplace = True)
titanic_df['Embarked'].fillna('N', inplace = True)

print('데이터 세트 Null 값 개수', titanic_df.isnull().sum().sum())

데이터 세트 Null 값 개수 0